#ifndef __LAN_DP_REPORT_CNTL_MASTER_API_H
#define __LAN_DP_REPORT_CNTL_MASTER_API_H

#include "tuya_cloud_com_defs.h"

#ifdef __cplusplus
extern "C" {
#endif

/***********************************************************
*************************micro define***********************
***********************************************************/

/***********************************************************
*************************variable define********************
***********************************************************/

/***********************************************************
*************************function define********************
***********************************************************/

//设置需要局域网上报给master的子设备
OPERATE_RET lan_dp_report_add_subdev(CHAR_T *gw_id, CHAR_T *sub_id);

#ifdef __cplusplus
}
#endif
#endif
